meal-planner-api/app/controllers/api/v1/planners_controller.rb

SELECT "planners".* FROM "planners" WHERE "planners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        planner = Planner.find(params[:id])

INSERT INTO "planners" ("user_id", "name", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["name", "Now"], ["duration", 4], ["created_at", "2020-03-07 16:47:23.789015"], ["updated_at", "2020-03-07 16:47:23.789015"]]
---
    def create
        planner = Planner.new(planner_params)
        planner.user = current_user
        planner.save

SELECT "planners".* FROM "planners" WHERE "planners"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "planners" SET "name" = $1, "duration" = $2, "updated_at" = $3 WHERE "planners"."id" = $4  [["name", "Done"], ["duration", 2], ["updated_at", "2020-03-09 13:48:25.799572"], ["id", 1]]
---
    def update
        planner = Planner.find(params[:id])
        # authorize_user_resource(planner)
        recipes = planner.recipes
        planner.update(planner_params)

SELECT "planners".* FROM "planners" WHERE "planners"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def destroy
        planner = Planner.find(params[:id])