meal-planner-api/app/controllers/api/v1/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        recipes = Recipe.all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        recipe = Recipe.find(params[:id])

SELECT "planners".* FROM "planners" WHERE "planners"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
INSERT INTO "planner_recipes" ("planner_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["planner_id", 3], ["recipe_id", 11], ["created_at", "2020-03-09 16:50:23.641946"], ["updated_at", "2020-03-09 16:50:23.641946"]]
---
    def create
        # planner_recipe = PlannerRecipe.new(planner_recipe_params)
        # planner_recipe.save
        current_planner = Planner.find_by_id(params[:planner_id].to_i)
        current_recipe = Recipe.find_by_id(params[:planner_recipe][:recipe_id].to_i)
        planner_recipe = current_planner.recipes<<(current_recipe)